## Pandas Analysis - Day2 HW

In [15]:
# Some basic package imports
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import plotly.express as px
from plotly.subplots import make_subplots
import plotly.io as pio
pio.renderers.defaule = 'colab'

In [16]:
!conda install -y kagglehub

Jupyter detected...
2 channel Terms of Service accepted
Channels:
 - conda-forge
 - defaults
Platform: osx-arm64
doneecting package metadata (repodata.json): -
doneing environment: -

# All requested packages already installed.

In [17]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("yasserh/titanic-dataset")

print("Path to dataset files:", path)

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.8), please consider upgrading to the latest version (0.3.13).
Path to dataset files: /Users/anika_tabassum/.cache/kagglehub/datasets/yasserh/titanic-dataset/versions/1

In [21]:
# Copy the path to the data set
file = '/Users/anika_tabassum/.cache/kagglehub/datasets/yasserh/titanic-dataset/versions/1/'
import os #helping me to see my downloaded file name
os.listdir(file)
# Yours will be different!

['Titanic-Dataset.csv']

In [23]:
df = pd. read_csv(file+'Titanic-Dataset.csv')

In [24]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Your goal is to do a quick analysis of the Titanic data! You can answer any questions that you find interesting but here are some things to start with:

How many variables and observations? Which are Numerical/Categorical?
Do any of the columns have NaNs in them? What do NaNs mean?
How many passengers survived?
Is survival correlated with Fare?
How many passengers were alone vs. traveling with family?
Were people traveling alone more or less likely to survive?
Do the basic statistics change if you group by class?
and so on... see if you can come up with some questions of your own! Curiosity is a big part of data science!

How far can you get in just an hour or two?

In [25]:
#1 How many variables and observations? Which are Numerical/Categorical?

df.shape #This shows (rows, columns)

#12 Variables and 891 observations

(891, 12)

In [26]:
#Which are Numerical/Categorical?
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

This tells us that there are 5 categorical columns and 7 numerical columns that are either float or
integers. There are 891 observations and 12 columns.

In [27]:
#Do any of the columns have NaNs in them? What do NaNs mean?
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

NaN means Not a Number. Indicates missing or unknown data. For example, maybe they didn’t record someone’s age or cabin.

In [28]:
#How many passengers survived?
df['Survived'].value_counts()
#In total only 342 passengers survived.

Survived
0    549
1    342
Name: count, dtype: int64

In [29]:
#Is survival correlated with Fare?
df[['Survived','Fare']].groupby('Survived').mean()
#On average, survivors paid higher fares.

               Fare
Survived
0         22.117887
1         48.395408

Those who survived and their fare paid had a weak positive correlation. This means that as fare tickets become more expensive, the higher the likelihood to survive.

In [30]:
#How many passengers were alone vs. traveling with family?
df['Alone'] = (df['SibSp'] + df['Parch'] == 0)
df['Alone'].value_counts()

#537 passengers were alone, 354 passengers were with a family

Alone
True     537
False    354
Name: count, dtype: int64

In [31]:
#Were people traveling alone more or less likely to survive?
df.groupby('Alone')['Survived'].mean()

#Survivors were less likely to be alone.People with family around had a slightly better survival rate.

Alone
False    0.505650
True     0.303538
Name: Survived, dtype: float64

In [32]:
#Do the basic statistics change if you group by class?
df.groupby('Pclass')['Survived'].mean()

#The people traveling alone were not more likely to survive. There is a moderately negative correlation between people who survived and people who survived when traveling alone.

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [33]:
#Did women survive more often than men?
df.groupby('Sex')['Survived'].mean()
#Yes

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

women survived more often than men

In [34]:
#Did age matter?
df.groupby('Survived')['Age'].mean()

#Survivors tended to be younger (children had better chances).

Survived
0    30.626179
1    28.343690
Name: Age, dtype: float64

#Anika's note

df.shape → tells us “how big is the table?” (passengers × variables).
df.dtypes → shows which columns are numbers and which are text (important for analysis).
df.isna().sum() → checks if we’re missing data anywhere. NaN means missing.
df['Survived'].value_counts() → counts how many survived vs. not survived.
groupby('Survived').mean() → helps compare averages between survivors vs. non-survivors.
df['Alone'] → makes a new column to mark if someone traveled alone.
df.groupby('Alone')['Survived'].mean() → checks survival chance for solo vs. family.
df.groupby('Pclass')['Survived'].mean() → checks if class (1st/2nd/3rd) mattered.
df.groupby('Sex')['Survived'].mean() → checks if gender mattered (it did).
df.groupby('Survived')['Age'].mean() → checks if younger passengers had better survival.